demo/FSIBeam_interFSIFoam_2206/runData/fluidDomain/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application       interFSIFoam;
startFrom         latestTime;
startTime         0.;
stopAt            endTime;
endTime           1.0;
deltaT            0.03;
writeControl      timeStep;
writeInterval     1;
purgeWrite        0;
writeFormat       ascii;
writePrecision    18;
writeCompression  uncompressed;
timeFormat        general;
timePrecision     18;
graphFormat 	  gnuplot;
runTimeModifiable yes;
adjustTimeStep    no;
maxCo             0.2;
maxAlphaCo     	  1;
maxDeltaT         1.0E-00;
libs
(

);

//###########################################################################//

functions
{

	beamForces
	{
	    type                forces;
	    libs  ("libforces.so");
	    enabled             true;
	    writeControl       timeStep;
	    writeInterval      1;
        timeStart           0.;
        timeEnd             1.E+10;

	    patches             ( "interface" );
	    directForceDensity  no;
	    p               p;
	    U               U;
	    rho             rhoInf;
	    log                 true;           // Dump to file

	    CofR                (0. 0. 0.);

	    rhoInf              1;
	}

	beamForceCoeffs
	{
	    type                forceCoeffs;
	    libs  ( "libforces.so" );
	    enabled             true;
	    writeControl       timeStep;
	    writeInterval      1;
        timeStart           0.;
        timeEnd             1.E+10;

	    patches             ( "interface" );
	    directForceDensity  no;
	    p               p;
	    U               U;
	    rho             rhoInf;
	    log                 true;

	    liftDir             (0. 1. 0.);
	    dragDir             (1. 0. 0.);
	    CofR                (0. 0. 0.);
	    pitchAxis           (0. 0. 1.);

	    magUInf             1;
	    rhoInf              1;
	    lRef                1.0;
	    Aref                1.0;
	}
}

// ************************************************************************* //
